
"NSLessThanPredicateOperatorType" = "is less than";
"NSLessThanOrEqualToPredicateOperatorType" = "is less than or equal to";
"NSGreaterThanPredicateOperatorType" = "is greater than";
"NSGreaterThanOrEqualToPredicateOperatorType"="is greater or equal to";
"NSEqualToPredicateOperatorType" = "is equal to";
"NSNotEqualToPredicateOperatorType" = "is not equal to";
"NSMatchesPredicateOperatorType" = "matches";
"NSLikePredicateOperatorType" = "is like";
"NSBeginsWithPredicateOperatorType" = "begins with";
"NSEndsWithPredicateOperatorType" = "ends with";
"NSInPredicateOperatorType" = "is in";
"NSCustomSelectorPredicateOperatorType"="evaluate YES to selector";
"NSContainsPredicateOperatorType" = "contains";
"NSBetweenPredicateOperatorType" = "is between";

"NSNotPredicateType" = "None";
"NSAndPredicateType" = "All";
"NSOrPredicateType" = "Any";
